In [1]:
import numpy as np
import pandas as pd

# Load the data
df = pd.read_excel("21zp33ny.xlsx")

In [4]:
df = df[["NEW YORK", "Unnamed: 1", "Unnamed: 2"]]

In [6]:
# for each row, delete nan values
df = df.dropna()

In [7]:
df.columns = ["ZIP code", "number_of_returns", "total_income"]

            NEW YORK                     Unnamed: 1               Unnamed: 2
2      ZIP\ncode [1]  Size of adjusted gross income  Number of \nreturns [2]
5                  0                          Total                  9620850
6                  0               $1 under $25,000                  2691220
7                  0          $25,000 under $50,000                  2324490
8                  0          $50,000 under $75,000                  1424670
...              ...                            ...                      ...
12287          99999          $25,000 under $50,000                    17620
12288          99999          $50,000 under $75,000                    11330
12289          99999         $75,000 under $100,000                     7560
12290          99999        $100,000 under $200,000                    13140
12291          99999               $200,000 or more                    11710

[9218 rows x 3 columns]